import turtle as t
# from a import run    # 导入了a文件中的坐标
t.color("white")
t.dot(10000, "black")

# run()
def goto(x,y):
    t.up()
    t.goto(x,y)
    t.down()


def yi(a,b,fill='',s=-10): 
    """
    a：传入一个角度列表
    b：传入一个步数
    fill：默认设置为空，如果传入颜色代表填充
    s：代表一个倾斜一点,默认倾斜-10
    注意：这个函数需要独立写出来，后面就可以反复使用该函数，主要是一些角度和turtle前进的步数
    """
    # step = -10  # 这个用来代表斜度
    t.fillcolor(fill)
    t.begin_fill()                  # 开始填充
    for i in range(len(a)):         # 循环次数根据列表的长度来计算
        t.setheading(a[i]+s)        # 角度是从a列表中的第i项
        t.fd(b[i])                  # 步数是从b列表中的第i项 
    t.end_fill()                    # 结束填充
    # 显示坐标
    # t.write(t.pos())
    
def gq():
    t.color("red")
    goto(-75, -276)
    a = [180,90,0,-90] 
    b = [35,66,35,66]
    yi(a, b,"red")
    # 星星
    t.color("yellow")
    goto(-90,-260)
    t.setheading(110)
    t.begin_fill()
    t.circle(8, 720, 5)
    t.end_fill()
    # 小星星1
    goto(-96,-249)
    t.circle(3, 720, 5)
    # 2
    goto(-90,-247)
    t.circle(3, 720, 5)
    # 3
    goto(-84,-249)
    t.circle(3, 720, 5)
    # 4
    goto(-80,-253)
    t.circle(3, 720, 5)
    # t.hideturtle()

    
t.speed(1000)
# 右太阳能版
a = [0,-90,180,90,  0,-90,0,90,0,-90,180,  40,-90,145 ]
b = [100,50,100,50,  40,50,40,50,20,25,130,  40,50,40]
yi(a[0:4], b[0:4],'blue')
yi(a[4:], b[4:])
# 左边
goto(-90, -10)
a = [90,180,-90,0,90,  180,-90,180,90,180,-90,0,  135,-90,39]
b = [25,100,50,100,50,  40,50,40,50,20,25,125,  37,50,37]
yi(a[0:5], b[0:5], "blue")
yi(a[5:], b[5:])
# 长边形
a = [90]
b = [50]
yi(a, b)
t.begin_fill()
t.circle(-15)
t.fd(-100)
t.circle(-15)
goto(-41,-64)
t.fd(100)
# # 连接轴
a = [-90,180,-90,0,-90,0,-90,180,-90,180,-90,180,90,180,90,180,90,0,90,0,90]
b = [120,10,20,10,10,20,6,20,10,10,20,6,20,10,10,20,6,20,10,10,20]
yi(a, b)
t.write(t.pos())
# 左边的试验舱通道
goto(-95, -110)
a = [-90,180,90,0,-90]
b = [20,80,46,80,20]
yi(a, b)
# # 痕
goto(-125, -75)
t.fd(46)
# # 左太阳能板
goto(-220, -76)
a = [90,180,-90,0,90,  -90,180,90]
b = [30,20,80,20,30, 30,8,80]
yi(a[0:5], b[0:5], "blue")
yi(a[5:], b[5:])
# 左方柱
goto(-168, -83)
a = [180,-90,0,90,180,  -90,180,90]
b = [60,20,60,20,20,  20,20,20]
yi(a[0:5], b[0:5],"gray")
yi(a[5:],b[5:])

# # 右实验舱
goto(-36, -120)
a = [90,0,-90,180,90]
b = [20,80,46,80,20]
yi(a, b)
goto(5,-150)
t.fd(46)

# # 右太阳能翼
goto(95,-128)
a = [90,0,-90,180,90,  -90,0,90]
b = [30,20,80,20,30,  30,8,80]
yi(a[0:5], b[0:5], 'blue')
yi(a[5:], b[5:])
# 右方柱 
goto(40,-142)
a = [0,90,180]
b = [60,20,60]
yi(a, b, "gray")
# 痕
goto(60,-145)
a = [90,0,-90]
b = [20,20,20]
yi(a, b)
# 国旗舱
goto(-63, -130)
# 小轴
a = [0,-90,180,90,0,  180,-90,0,-90,180]
b = [10,60,26,60,10,  10,20,26,20,26]
yi(a[0:5], b[0:5],"gray")
yi(a[5:], b[5:])
# 舱
a = [-90, 180,-90,0,90,180]
b = [20, 15,100,56,100,20]
yi(a, b)

# # 国旗
gq()
t.color("white")
# 封顶大吉
goto(-122, -284)
t.setheading(90)
t.circle(-29, -180)

# 隐藏画笔
t.hideturtle()

t.done()
